app/controllers/pins_controller.rb

  def pinsof
    @user_id=params[:user_id]#como php creo
    @user=User.find(@user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @pin = Pin.new(pin_params)

    respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("photo", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def update
    respond_to do |format|
      if @pin.update(pin_params)
---
UPDATE "pins" SET "name" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["name", "name1"], ["updated_at", "2017-10-29 19:35:39.350278"], ["id", 5]]